Revit 2027 API
DirectShape.UpdateExternallyTaggedGeometry Method
 Updates the externally tagged geometry object in the DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
Public Sub UpdateExternallyTaggedGeometry (
	externallyTaggedGeometry As ExternallyTaggedGeometryObject
)
public:
void UpdateExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
member UpdateExternallyTaggedGeometry :
        externallyTaggedGeometry : ExternallyTaggedGeometryObject -> unit
Parameters
externallyTaggedGeometry ExternallyTaggedGeometryObject
 The externally tagged geometry that should be updated in the DirectShape.
Exceptions
Exception | Condition
ArgumentException |  The input shape does not satisfy DirectShape validation criteria. -or- A previous version of the externally tagged geometry is not present in this DirectShape.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace